Section_4_Real_Workload_Validation/Experiment13/data/raw/case-C/sustained-ramp/trial_014/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 41.781ms, rate sampling interval: 89ms
  Thread calibration: mean lat.: 43.514ms, rate sampling interval: 92ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.04ms   12.17ms 224.38ms   95.77%
    Req/Sec   200.59    115.30   510.00     74.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   39.29ms
 75.000%   42.37ms
 90.000%   47.46ms
 99.000%   81.98ms
 99.900%  189.70ms
 99.990%  223.62ms
 99.999%  224.38ms
100.000%  224.51ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      28.239     0.000000            1         1.00
      33.983     0.100000         6804         1.11
      35.711     0.200000        13689         1.25
      37.087     0.300000        20520         1.43
      38.271     0.400000        27307         1.67
      39.295     0.500000        33998         2.00
      39.839     0.550000        37373         2.22
      40.415     0.600000        40897         2.50
      40.991     0.650000        44289         2.86
      41.631     0.700000        47639         3.33
      42.367     0.750000        51059         4.00
      42.847     0.775000        52700         4.44
      43.487     0.800000        54383         5.00
      44.223     0.825000        56075         5.71
      45.119     0.850000        57809         6.67
      46.175     0.875000        59499         8.00
      46.783     0.887500        60348         8.89
      47.455     0.900000        61173        10.00
      48.319     0.912500        62005        11.43
      49.247     0.925000        62869        13.33
      50.463     0.937500        63713        16.00
      51.231     0.943750        64133        17.78
      52.031     0.950000        64555        20.00
      52.959     0.956250        64989        22.86
      54.207     0.962500        65408        26.67
      55.487     0.968750        65828        32.00
      56.191     0.971875        66045        35.56
      56.927     0.975000        66256        40.00
      57.855     0.978125        66465        45.71
      59.423     0.981250        66677        53.33
      62.143     0.984375        66890        64.00
      65.791     0.985938        66995        71.11
      67.647     0.987500        67102        80.00
      73.151     0.989062        67209        91.43
      84.351     0.990625        67313       106.67
      95.679     0.992188        67420       128.00
     104.063     0.992969        67474       142.22
     117.695     0.993750        67527       160.00
     135.935     0.994531        67582       182.86
     154.239     0.995313        67632       213.33
     157.695     0.996094        67686       256.00
     162.175     0.996484        67712       284.44
     163.455     0.996875        67739       320.00
     174.079     0.997266        67766       365.71
     177.279     0.997656        67791       426.67
     182.015     0.998047        67819       512.00
     183.807     0.998242        67834       568.89
     184.703     0.998437        67846       640.00
     186.367     0.998633        67859       731.43
     188.159     0.998828        67871       853.33
     189.823     0.999023        67884      1024.00
     190.975     0.999121        67892      1137.78
     191.615     0.999219        67897      1280.00
     194.431     0.999316        67905      1462.86
     201.471     0.999414        67913      1706.67
     205.183     0.999512        67917      2048.00
     205.823     0.999561        67921      2275.56
     206.079     0.999609        67924      2560.00
     206.591     0.999658        67928      2925.71
     207.615     0.999707        67931      3413.33
     223.103     0.999756        67937      4096.00
     223.103     0.999780        67937      4551.11
     223.103     0.999805        67937      5120.00
     223.359     0.999829        67940      5851.43
     223.487     0.999854        67941      6826.67
     223.615     0.999878        67944      8192.00
     223.615     0.999890        67944      9102.22
     223.615     0.999902        67944     10240.00
     223.743     0.999915        67945     11702.86
     223.871     0.999927        67946     13653.33
     223.871     0.999939        67946     16384.00
     224.127     0.999945        67947     18204.44
     224.127     0.999951        67947     20480.00
     224.255     0.999957        67948     23405.71
     224.255     0.999963        67948     27306.67
     224.255     0.999969        67948     32768.00
     224.383     0.999973        67949     36408.89
     224.383     0.999976        67949     40960.00
     224.383     0.999979        67949     46811.43
     224.383     0.999982        67949     54613.33
     224.383     0.999985        67949     65536.00
     224.511     0.999986        67950     72817.78
     224.511     1.000000        67950          inf
#[Mean    =       41.040, StdDeviation   =       12.166]
#[Max     =      224.384, Total count    =        67950]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  71604 requests in 3.00m, 58.25MB read
Requests/sec:    397.72
Transfer/sec:    331.30KB